# SQL Mini Project

Welcome to the SQL mini project. You will carry out this project partly in
the PHPMyAdmin interface, and partly in Jupyter via a Python connection.
<br>
This is Tier 2 of the case study, which means that there'll be less guidance for you about how to setup your local SQLite connection in PART 2 of the case study. This will make the case study more challenging for you: you might need to do some digging, and revise the Working with Relational Databases in Python chapter in the previous resource.
<br>
Otherwise, the questions in the case study are exactly the same as with Tier 1.

## PART 1: PHPMyAdmin

You will complete questions 1-9 below in the PHPMyAdmin interface. 
Log in by pasting the following URL into your browser, and
using the following Username and Password: 
<br>
URL: https://sql.springboard.com/ 
<br>
Username: student
<br>
Password: learn_sql@springboard
<br>
The data you need is in the "country_club" database. This database
contains 3 tables:
<br>
> i) the "Bookings" table,
    <br>
> ii) the "Facilities" table, and
    <br>
> iii) the "Members" table.
    <br>
    
In this case study, you'll be asked a series of questions. You can
solve them using the platform, but for the final deliverable,
paste the code for each solution into this script, and upload it
to your GitHub.
<br>
Before starting with the questions, feel free to take your time,
exploring the data, and getting acquainted with the 3 tables.

**Q1:** Some of the facilities charge a fee to members, but some do not.
Write a SQL query to produce a list of the names of the facilities that do.
<br> <br>
SELECT name 
<br>
FROM Facilities 
<br>
WHERE membercost > 0;

**Q2:** How many facilities do not charge a fee to members?
<br> <br>
SELECT COUNT(*) 
<br>
FROM Facilities 
<br>
WHERE membercost > 0;

**Q3:** Write an SQL query to show a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost.
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question.
<br> <br>
SELECT facid, name, membercost, monthlymaintenance 
<br>
FROM Facilities 
<br>
WHERE membercost < 0.2*(monthlymaintenance);

**Q4:** Write an SQL query to retrieve the details of facilities with ID 1 and 5.
Try writing the query without using the OR operator. 
<br> <br>
SELECT * 
<br>
FROM Facilities 
<br>
WHERE facid IN (1, 5);

**Q5:** Produce a list of facilities, with each labelled as
'cheap' or 'expensive', depending on if their monthly maintenance cost is
more than $100. Return the name and monthly maintenance of the facilities
in question. 
<br> <br>
SELECT name, 
<br>
    monthlymaintenance, 
    <br>
    CASE WHEN monthlymaintenance > 100 THEN 'expensive'
    <br>
    WHEN monthlymaintenance <= 100 THEN 'cheap' END AS monthlymaintenancecost
    <br>
FROM Facilities;

**Q6:** You'd like to get the first and last name of the last member(s)
who signed up. Try not to use the LIMIT clause for your solution. 
<br> <br>
SELECT surname, firstname, joindate 
<br>
FROM Members 
<br>
ORDER BY joindate DESC;

**Q7:** Produce a list of all members who have used a tennis court.
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name. 
<br> <br>
SELECT DISTINCT CONCAT(m.surname, ', ', m.firstname) AS membername, f.name, f.facid
<br>
FROM Members AS m
<br>
INNER JOIN Bookings AS b
<br>
ON m.memid = b.memid
<br>
Inner Join Facilities AS f
<br>
ON b.facid = f.facid
<br>
WHERE f.name LIKE 'Tennis Court%'
<br>
ORDER BY membername;

**Q8:** Produce a list of bookings on the day of 2012-09-14 which
will cost the member (or guest) more than $30. Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries.
<br> <br>
SELECT f.name AS facilityname, 
<br>
>    CASE WHEN m.memid != 0 <br>
        THEN CONCAT(m.surname, ', ', m.firstname) <br>
    ELSE 'Guest' END AS clientname, <br>  
    CASE WHEN m.memid != 0 <br>
       THEN (b.slots * f.membercost) <br>
    ELSE (b.slots * f.guestcost) END AS cost

FROM Members AS m
<br>
INNER JOIN Bookings AS b
<br>
ON m.memid = b.memid
<br>
INNER JOIN Facilities AS f
<br>
ON b.facid = f.facid
<br>
WHERE starttime LIKE '2012-09-14%'
<br>
HAVING cost > 30
<br>
ORDER BY cost DESC;

**Q9:** This time, produce the same result as in Q8, but using a subquery.
<br> <br>
SELECT facilityname, clientname, cost
<br>
FROM 
<br>
>	(SELECT
		f.name AS facilityname, <br>
     	CASE WHEN m.memid != 0
			THEN CONCAT(m.surname, ', ', m.firstname) 
		ELSE 'Guest' END AS clientname, <br>
		CASE WHEN m.memid != 0
			THEN (b.slots * f.membercost)
		ELSE (b.slots * f.guestcost) END AS cost <br>
     FROM Bookings as b <br>
     JOIN Facilities AS f <br>
     ON b.facid = f.facid <br>
     JOIN Members AS m <br>
     ON b.memid = m.memid <br>
     WHERE starttime LIKE '2012-09-14%') AS subquery

HAVING cost > 30
<br>
ORDER BY cost DESC;

## PART 2 : SQLITE

Export the country club data from PHPMyAdmin, and connect to a local SQLite instance from Jupyter notebook for the following questions.

**Q10:** Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members!

In [1]:
import sqlite3 as sql
import pandas as pd

In [2]:
con = sql.connect('country_club.db')

In [3]:
query10 = "SELECT f.name AS Facility_Name, SUM(CASE WHEN m.memid != 0 THEN (b.slots * f.membercost) ELSE (b.slots * f.guestcost) END) AS Revenue FROM Members AS m  INNER JOIN Bookings AS b ON m.memid = b.memid INNER JOIN Facilities AS f ON b.facid = f.facid GROUP BY Facility_Name HAVING Revenue < 1000 ORDER BY Revenue DESC"
rs10 = con.execute(query10)

In [4]:
df10 = pd.DataFrame(rs10.fetchall())

In [5]:
df10.columns = [x[0] for x in rs10.description]

In [6]:
print(df10)

   Facility_Name  Revenue
0     Pool Table      270
1  Snooker Table      240
2   Table Tennis      180

**Q11:** Produce a report of members and who recommended them in alphabetic surname,firstname order

In [7]:
query11 = "SELECT DISTINCT CASE WHEN B.memid != 0 THEN (B.surname || ', ' || B.firstname)  END AS Member_Name, CASE WHEN A.memid !=0 THEN (A.surname || ', ' || A.firstname) END AS Recommending_Member_Name FROM Members AS A, Members AS B WHERE A.memid = B.recommendedby AND B.memid != 0 ORDER BY Member_Name"
rs11 = con.execute(query11)

In [8]:
df11 = pd.DataFrame(rs11.fetchall())

In [9]:
df11.columns = [x[0] for x in rs11.description]

In [10]:
print(df11)

                 Member_Name Recommending_Member_Name
0            Bader, Florence         Stibbons, Ponder
1                Baker, Anne         Stibbons, Ponder
2             Baker, Timothy          Farrell, Jemima
3                Boothe, Tim              Rownam, Tim
4            Butters, Gerald            Smith, Darren
5               Coplin, Joan           Baker, Timothy
6             Crumpet, Erica             Smith, Tracy
7                Dare, Nancy         Joplette, Janice
8           Genting, Matthew          Butters, Gerald
9                 Hunt, John       Purview, Millicent
10              Jones, David         Joplette, Janice
11            Jones, Douglas             Jones, David
12          Joplette, Janice            Smith, Darren
13           Mackenzie, Anna            Smith, Darren
14             Owen, Charles            Smith, Darren
15             Pinker, David          Farrell, Jemima
16        Purview, Millicent             Smith, Tracy
17         Rumney, Henrietta         Genting, Matthew
18         Sarwin, Ramnaresh          Bader, Florence
19               Smith, Jack            Smith, Darren
20          Stibbons, Ponder            Tracy, Burton
21  Worthington-Smyth, Henry             Smith, Tracy

**Q12:** Find the facilities with their usage by member, but not guests

In [11]:
query12 = "SELECT f.name AS Facility_Name, CASE WHEN m.memid !=0 THEN (m.surname || ', ' || m.firstname) END AS Member_Name, ((b.slots*30)/60.0) AS Usage_In_Hours FROM Members AS m INNER JOIN Bookings AS b ON m.memid = b.memid INNER JOIN Facilities AS f ON b.facid = f.facid WHERE b.memid != 0 GROUP BY b.memid, f.facid ORDER BY Member_Name, Facility_Name"
rs12 = con.execute(query12)

In [12]:
df12 = pd.DataFrame(rs12.fetchall())

In [13]:
df12.columns = [x[0] for x in rs12.description]

In [14]:
print(df12)

       Facility_Name               Member_Name  Usage_In_Hours
0    Badminton Court           Bader, Florence             1.5
1     Massage Room 2           Bader, Florence             1.0
2         Pool Table           Bader, Florence             0.5
3      Snooker Table           Bader, Florence             1.0
4       Squash Court           Bader, Florence             1.0
..               ...                       ...             ...
197     Squash Court      Tupperware, Hyacinth             1.0
198  Badminton Court  Worthington-Smyth, Henry             1.5
199   Massage Room 1  Worthington-Smyth, Henry             1.0
200       Pool Table  Worthington-Smyth, Henry             0.5
201     Table Tennis  Worthington-Smyth, Henry             1.0

[202 rows x 3 columns]

**Q13:** Find the facilities usage by month, but not guests

In [15]:
query13 = "SELECT f.name AS Facility_Name, ((SUM(slots)*30)/60.0) AS Usage_In_Hours, CASE WHEN STRFTIME('%m', starttime) = '07' THEN 'July' WHEN STRFTIME('%m', starttime) = '08' THEN 'August' WHEN STRFTIME('%m', starttime) = '09' THEN 'September' END AS Month FROM Members AS m INNER JOIN Bookings AS b ON m.memid = b.memid INNER JOIN Facilities AS f ON b.facid = f.facid WHERE b.memid != 0 GROUP BY Month, Facility_Name ORDER BY Month, Facility_Name"
rs13 = con.execute(query13)

In [16]:
df13 = pd.DataFrame(rs13.fetchall())

In [17]:
df13.columns = [x[0] for x in rs13.description]

In [18]:
print(df13)

      Facility_Name  Usage_In_Hours      Month
0   Badminton Court           207.0     August
1    Massage Room 1           158.0     August
2    Massage Room 2             9.0     August
3        Pool Table           151.5     August
4     Snooker Table           158.0     August
5      Squash Court            92.0     August
6      Table Tennis           148.0     August
7    Tennis Court 1           169.5     August
8    Tennis Court 2           172.5     August
9   Badminton Court            82.5       July
10   Massage Room 1            83.0       July
11   Massage Room 2             4.0       July
12       Pool Table            55.0       July
13    Snooker Table            70.0       July
14     Squash Court            25.0       July
15     Table Tennis            49.0       July
16   Tennis Court 1           100.5       July
17   Tennis Court 2            61.5       July
18  Badminton Court           253.5  September
19   Massage Room 1           201.0  September
20   Massage Room 2            14.0  September
21       Pool Table           221.5  September
22    Snooker Table           202.0  September
23     Squash Court            92.0  September
24     Table Tennis           200.0  September
25   Tennis Court 1           208.5  September
26   Tennis Court 2           207.0  September

In [19]:
con.close()